In [ ]:
# 시리즈 변수

In [2]:
import pandas as pd
리스트변수 = ['홍길동', '이순신', '유관순', '윤봉길']
시리즈변수 = pd.Series(리스트변수)
type(시리즈변수)

pandas.core.series.Series

In [5]:
시리즈변수

0    홍길동
1    이순신
2    유관순
3    윤봉길
dtype: object

In [8]:
# 데이터프레임
import pandas as pd
리스트변수 = (['홍길동', 29, '여'], ['이순신', 24, '남'],
                ['유관순', 38, '남'], ['윤봉길', 31, '여'])
# '리스트변수'를 데이터프레임 타입으로 변경하여 '데이터프레임변수'에 저장하기
데이터프레임변수 = pd.DataFrame(리스트변수)
type(데이터프레임변수)

pandas.core.frame.DataFrame

In [9]:
데이터프레임변수

     0   1  2
0  홍길동  29  여
1  이순신  24  남
2  유관순  38  남
3  윤봉길  31  여

In [15]:
데이터프레임변수.index = ['1번', '2번', '3번', '4번']
데이터프레임변수

      0   1  2
1번  홍길동  29  여
2번  이순신  24  남
3번  유관순  38  남
4번  윤봉길  31  여

In [17]:
데이터프레임변수.columns = ['이름', '나이', '성별']
데이터프레임변수

     이름  나이 성별
1번  홍길동  29  여
2번  이순신  24  남
3번  유관순  38  남
4번  윤봉길  31  여

In [18]:
# '데이터프레임변수'에서 '나이' 열의 데이터만 가져오기
데이터프레임변수['나이']

1번    29
2번    24
3번    38
4번    31
Name: 나이, dtype: int64

In [19]:
# '데이터프레임변수'에서 '나이', '성별'열의 데이터만 가져오기
데이터프레임변수[['나이', '성별']]

    나이 성별
1번  29  여
2번  24  남
3번  38  남
4번  31  여

In [20]:
데이터프레임변수[1:3]

     이름  나이 성별
2번  이순신  24  남
3번  유관순  38  남

In [21]:
데이터프레임변수['2번':'3번']

     이름  나이 성별
2번  이순신  24  남
3번  유관순  38  남

In [ ]:
# 파일 읽고 쓰기 위한 판다스 라이브러리를 가져오기
import pandas as pd
# data 경로의 train.csv 파일 가져오기
데이터 = pd.read_csv('./bigData-main/train.csvT')